app/views/ideas/_form.html.erb

SELECT "categories".* FROM "categories"
---
          <%= form.label :category_id, class:"label" %>
          <%= form.collection_select :category_id, Category.all, :id, :name, class:"form-control" %>