app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("name", "content", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test"], ["content", "Initial test"], ["category_id", 3], ["user_id", 1], ["created_at", "2020-08-24 20:23:18.318329"], ["updated_at", "2020-08-24 20:23:18.318329"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "name" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Idea"], ["updated_at", "2020-08-22 17:33:39.656236"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)